{
  "intents" : [
    {
      "tag" : "greetings",
      "patterns" : ["Hi", "Hey", "Hello", "Good Morning!", "greetings", "what's up?", "how you doing?"],
      "responses" : ["Hello", "Hi", "What can I do for you?", "Tell me what can i do for you?"]
    },
    {
      "tag" : "goodbye",
      "patterns" : ["That's all", "Thank you for your help!", "Thank you", "GoodBye!", "Bye", "Have a good day!"],
      "responses" : ["It feels good to be helpful", "Goodbye!", "If you need me anytime in the future you know where to find me!", "Have a Good day!"]
    },
    {
      "tag" : "intro",
      "patterns": ["What is your name?", "What are you called?", "May I know your name?", "What does your owner calls you?", "what can I call you?"],
      "responses" : ["I am called botty! I know you might wonder what kind of a name is it, Well cannot say much it is just an anecdote on my creators coding skills :) , also you can call me anytime ¬‿¬. JUST KIDDING, please do not call me I am not that social. So what can I do for you??"]
    },
    {
      "tag" : "work",
      "patterns" : ["What do you do?", "what is your role?", "why are you needed?", "What is it that you do here?"],
      "responses" : ["I am a ChatBot that is designed to reply all of your funky and quirky questions. So are you ready to ask yet?", "I am an AI chatBot created to have a nice conversation with the customer and resolve any doubt they might comeup with.", "I am botty here for your assisstance!"]
    },
    {
      "tag" : "creator",
      "patterns" : ["Who made you?", "Who owns you?", "name your creators", "may i know who made you?", "masterminds behind you"],
      "responses" : ["Priyansh Gupta and Dhruv Aggarwal are my creators!, You can know more about them using the 'about us' button in the bottom", "I was made by Priyansh Gupta and Dhruv Aggarwal for the ChatHacks hackathon held by MLH. You can know more about them using the 'know more' button in the bottom."]
    },
    {
      "tag" : "fun#1",
      "patterns" : ["Give me a fun fact!", "Give me fun fact", "fact's time!"],
      "responses" : ["It is the first hackathon for both of the creators.", "A crocodile cannot stick its tongue out.", "The Mona Lisa has no eyebrows.", " 'I Am' is the shortest complete sentence in the English language.", "C and Java have variants of python named CPython and jython", "Python is an open-source language!", "NASA still operates some projects on programming from the 1970's", "There are around 700 separate programming languages", "Computer Programming was instrumental in helping end World War II."]
    },
    {
      "tag" : "fun#2",
      "patterns" : ["Botty I choose you", "I choose you","go botty", "pika pikachu!", "I Want to become the master Pokemon trainer."],
      "responses" : ["Hmm another Poke fan! Well here's a fact - Rhydon is the 1st Pokemon ever created.", "Hmm another Poke fan! Well here's a fact - Pikachu and Meowth have opposite Pokedex numbers.", "Hmm another Poke fan! Well here's a fact - There's an enzyme named after Pikachu.","Hmm another Poke fan! Well here's a fact - Drowzee's skill is derived from Japanese folklore.","Hmm another Poke fan! Well here's a fact - The creator of Pokemon was inspired by insect-catching.","Hmm another Poke fan! Well here's a fact - Hitmonlee & Hitmonchan are derived from Bruce Lee and Jackie Chan.","Hmm another Poke fan! Well here's a fact - Pokemons actual full name is Pocket-Monsters.","Hmm another Poke fan! Well here's a fact - The anime was only meant to last for one season","Hmm another Poke fan! Well here's a fact - Over 30 billion Pokemon cards have been sold","Hmm another Poke fan! Well here's a fact - Pikachu wasn't Pokemon's original mascot","Hmm another Poke fan! Well here's a fact - 1.99m difference between the shortest & tallest Pokemon","Hmm another Poke fan! Well here's a fact - Pokemon was created by a video game designer called Satoshi Tajiri in 1995"]
    },
    {
      "tag" : "shipping",
      "patterns" : ["When will my shipment arrive?", "Where is the delivery?", "is the package out for delivery yet?", "when will my delivery arrive?", "is my delivery out yet?", "when will my package leave for delivery?"],
      "responses" : ["Your package is currently under the shipping proecss", "It is not out yet, We will let you know when it does!", "It is out for delivery so you could expect the delivery soon!"]
    },
    {
      "tag" : "service",
      "patterns" : ["Could you please provide me with service centres contact informations", "Service centers contact information","address of the service centre", "need assistance!"],
      "responses" : ["You could always contact to us using the email: help@service.com or if you wish you could visit us locally at 2nd street, UP, INDIA"]
    },
    {
      "tag" : "stocks",
      "patterns" : ["What are the stocks that i own?", "Stocks under my portfolio?", "Shares that I own?"],
      "responses" : ["The Stocks under your portfolio are: ADANI POWER, RELIANCE, TATA STEEL, WIPRO, INFOSYS, TCS."]
    }
  ]
}